## 판다스 (Pandas)

- 핵심객체는 DataFrame이다
- 데이타프레임은 2차원 데이터 구조체로 넘파이보다 편리하게 데이타 핸들링한다.
- R 언어의 데이타 프레임과 비슷하고 많이 사용된다


#### DataFrame 에서 데이타 필터링 ( 추출하기 )

0. 맨처음에는

    + df[2] : 2행의 데이타 추출
    + df['A'] : A열(컬럼) 데이타 추출
    
    + df[n:m] : n번째부터 m-1번째까지의 행 추출
        
        ` 행과 열을 섞어서 추출함.
        
        ` 판다스를 만든 사람이 쓴 책의 번역서를 보면 이 부분을 후회한다고 나옴
        
        ` df[2] 이 형식은 에러 발생 ( 2021.01)
      

1. 열(컬럼) 추출

    + df.컬럼명
    + df['컬럼명']
       
    
2. 행 추출

    + df.loc[] : 인덱스 지정하지 않으면 인덱스(순서), 인덱스 지정하면 인덱스로 추출
    + df.iloc[] : 인덱스(순서)로 추출


    [참고] 
    
    - 위 연산자는 노련한 개발자들도 혼동하기에, 일반적으로 하나만 선택해서 사용하는 것을 권장한단다
    - 넘파이와 유사한 부분으로 더우 혼동하기 쉽다
    - 판다스의 DataFrame와 Series에서도 다른이 있어서 주의해야 한다
    
    
3. 행과 열에서 추출
    
    + df.loc[2, 3] : 2 행의 3열 데이타
    + df.loc[1:3, 2:4] : 1부터 3행전까지의 행에서 2부터 4전까지의 열의 데이타

In [4]:
import pandas as pd

# 데이타 프레임 자료 생성
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = pd.DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [5]:
# 열(컬럼) 추출
df.name

0    홍길동
1    박길동
2    김길동
Name: name, dtype: object

In [6]:
# 열(컬럼) 추출
df['name']

0    홍길동
1    박길동
2    김길동
Name: name, dtype: object

In [7]:
# 행(레코드) 추출
df.loc[1]

name    박길동
age      33
dept     국어
Name: 1, dtype: object

In [8]:
# 행(레코드) 추출
df.iloc[1]

name    박길동
age      33
dept     국어
Name: 1, dtype: object

In [9]:
df2 = pd.DataFrame(mydata, index=['일', '이', '상'])
df2

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
상  김길동   44   산업

In [14]:
# 행(레코드) 추출
df2.iloc[1]

name    박길동
age      33
dept     국어
Name: 이, dtype: object

In [16]:
# 행(레코드) 추출
df2.loc['상']

name    김길동
age      44
dept     산업
Name: 상, dtype: object

### 컬럼 추가, 행 추가

In [18]:
# 컬럼 추가
df['gender'] = ['여자', '남자', '남자']
df

  name  age dept gender
0  홍길동   22   컴공     여자
1  박길동   33   국어     남자
2  김길동   44   산업     남자

In [20]:
# 행 추가
df.loc[3] = ['맹길동', 55, '컴공', '여자']
df

  name  age dept gender
0  홍길동   22   컴공     여자
1  박길동   33   국어     남자
2  김길동   44   산업     남자
3  맹길동   55   컴공     여자

In [21]:
# 행 추가
df.loc[99] = ['최길동', 55, '컴공', '남자']
df

   name  age dept gender
0   홍길동   22   컴공     여자
1   박길동   33   국어     남자
2   김길동   44   산업     남자
3   맹길동   55   컴공     여자
99  최길동   55   컴공     남자

### 변경

In [5]:
# 인덱스순서를 변경하려면 -> 인덱스는 우선 DataFrame이 있는 상태에서 변경해야 한다

In [23]:
# 컬럼연산
df['age+10'] = df['age'] + 10
df

   name  age dept gender  age+10
0   홍길동   22   컴공     여자      32
1   박길동   33   국어     남자      43
2   김길동   44   산업     남자      54
3   맹길동   55   컴공     여자      65
99  최길동   55   컴공     남자      65

In [28]:
# 3 행에 'dept'열의 값을 '인문'으로 변경

df['dept'].loc[3]
df.loc[3, 'dept']
df.iloc[3, 2] = '인문'

df

   name  age dept gender  age+10
0   홍길동   22   컴공     여자      32
1   박길동   33   국어     남자      43
2   김길동   44   산업     남자      54
3   맹길동   55   인문     여자      65
99  최길동   55   컴공     남자      65

###  컬럼 속성 추출

In [8]:
# 컬럼 속성 추출

In [9]:
# 특정 컬럼의 특정행 추출 -> 즉 특정셀 추출 (2번 인덱스의 dept 컬럼값은? )

In [31]:
# 30세 이상의 레코드 겁색
df['age']

0     22
1     33
2     44
3     55
99    55
Name: age, dtype: int64

In [32]:
df['age']>30

0     False
1      True
2      True
3      True
99     True
Name: age, dtype: bool

In [33]:
df[df['age']>30]

   name  age dept gender  age+10
1   박길동   33   국어     남자      43
2   김길동   44   산업     남자      54
3   맹길동   55   인문     여자      65
99  최길동   55   컴공     남자      65

In [34]:
# 인덱스 1의 name 값을 '맹길동'로 변경하려면?
df['name'].loc[1] = '맹길동'
df

C:\Users\kosmo\AppData\Local\Temp\ipykernel_14388\4076407840.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'].loc[1] = '맹길동'

   name  age dept gender  age+10
0   홍길동   22   컴공     여자      32
1   맹길동   33   국어     남자      43
2   김길동   44   산업     남자      54
3   맹길동   55   인문     여자      65
99  최길동   55   컴공     남자      65

# 여러 행 추출

In [37]:
df.loc[[1,3]]

  name  age dept gender  age+10
1  맹길동   33   국어     남자      43
3  맹길동   55   인문     여자      65

# 여러 열 추출

In [38]:
df[['name', 'age']]

   name  age
0   홍길동   22
1   맹길동   33
2   김길동   44
3   맹길동   55
99  최길동   55

## 데이타 필터링

- 넘파이와 유사한 부분으로 더우 혼동하기 쉽다

- 판다스의 DataFrame와 Series에서도 다른 부분이 있어서 주의해야 한다


1. loc[] : 인덱스와 명칭으로 추출

2. iloc[] : 인덱스로 추출

3. ix[] : 명치 기반 인덱싱과 위치 기반 인덱싱 모두 사용 (*  그러나 곧 사라질 예정 )


위 3 연산자는 노련한 개발자들도 혼동하기에,
일반적으로 하나만 선택해서 사용하는 것을 권장한단다

In [12]:
# 명칭기반 인덱스 : 인덱스를 지정한 경우

In [13]:
# 특정 컬럼으로 인덱스를 지정

### 정렬과 T

In [45]:
# 나이를 오름차순으로
# df.sort_index(ascending=0)   # 인덱스 정렬 기본값이 ascending=1


# 전문가들은 원본이 변경하지 않는 것을 권장
df.sort_values('age', ascending=False)
print(df)
df3 = df.sort_values('age', ascending=False)
print(df3)


# 원본 수정은 권장하지 않음
df.sort_values('age', ascending=False, inplace=True)
print(df)
# inplace -> 저장하지 않게 막아줌?

   name  age dept gender  age+10
0   홍길동   22   컴공     여자      32
1   맹길동   33   국어     남자      43
2   김길동   44   산업     남자      54
3   맹길동   55   인문     여자      65
99  최길동   55   컴공     남자      65
   name  age dept gender  age+10
3   맹길동   55   인문     여자      65
99  최길동   55   컴공     남자      65
2   김길동   44   산업     남자      54
1   맹길동   33   국어     남자      43
0   홍길동   22   컴공     여자      32
   name  age dept gender  age+10
3   맹길동   55   인문     여자      65
99  최길동   55   컴공     남자      65
2   김길동   44   산업     남자      54
1   맹길동   33   국어     남자      43
0   홍길동   22   컴공     여자      32

### 정보확인

In [46]:
# 총 데이터 건수와 데이타 타입등 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 3 to 0
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   dept    5 non-null      object
 3   gender  5 non-null      object
 4   age+10  5 non-null      int64
dtypes: int64(2), object(3)
memory usage: 240.0+ bytes

In [47]:
# 기본통계량 구하기 ( 총개수, 평균, 표준편차, 최소값, 4분위수 등)
df.describe()

             age     age+10
count   5.000000   5.000000
mean   41.800000  51.800000
std    14.342245  14.342245
min    22.000000  32.000000
25%    33.000000  43.000000
50%    44.000000  54.000000
75%    55.000000  65.000000
max    55.000000  65.000000